["Vendor: SecureNet Asia (ID: V001) Industry: Cybersecurity Location: MY Selangor Petaling Jaya Certifications: ISO27001|ISO9001 Capabilities: SOC monitoring, penetration testing, incident response, SIEM integration Attachments: SecureNet Asia provides 24x7 SOC monitoring with SIEM platforms such as Splunk and QRadar. Services include threat detection, incident response, and monthly security reporting. This certifies that SecureNet Asia complies with ISO/IEC 27001 information security management standards. Transactions: Recent transactions: 2 | Categories: Cybersecurity, Cybersecurity", "Vendor: TechNova Solutions (ID: V002) Industry: IT Services Location: MY WP Kuala Lumpur Kuala Lumpur Certifications: ISO9001 Capabilities: Software development, system integration, cloud migration Attachments: TechNova Solutions specializes in system integration, custom software development, and enterprise cloud migration projects for government and corporate clients. Transactions: Recent transactions: 1 | Categories: IT Services", "Vendor: GreenBuild Engineering (ID: V003) Industry: Construction Location: MY Johor Johor Bahru Certifications: CIDB G7|ISO9001 Capabilities: Commercial building construction, infrastructure works, project management Attachments: GreenBuild Engineering completed multiple commercial and infrastructure projects including highways, factories, and office towers. Transactions: Recent transactions: 1 | Categories: Construction", "Vendor: DataShield Consulting (ID: V004) Industry: Cybersecurity Location: SG Central Singapore Certifications: ISO27001 Capabilities: Risk assessment, compliance audit, data protection advisory Attachments: DataShield Consulting offers cybersecurity risk assessments, ISO27001 compliance audits, and regulatory advisory services across ASEAN. Transactions:", "Vendor: CloudAxis Sdn Bhd (ID: V005) Industry: Cloud Services Location: MY Penang George Town Certifications: ISO27001|ISO20000 Capabilities: Cloud hosting, DevOps, managed cloud security Attachments: CloudAxis delivers secure cloud hosting, DevOps automation, and managed security services on AWS and Azure platforms. Transactions: Recent transactions: 1 | Categories: Cloud Services", "Vendor: Alpha Office Supplies (ID: V006) Industry: Office Supplies Location: MY Selangor Shah Alam Certifications: nan Capabilities: Office stationery, printers, consumables Attachments: Transactions:", "Vendor: Meditech Systems (ID: V007) Industry: Healthcare IT Location: MY Selangor Subang Jaya Certifications: ISO13485|ISO9001 Capabilities: Hospital information systems, EMR, health data analytics Attachments: Meditech Systems develops hospital information systems, EMR platforms, and healthcare analytics compliant with medical standards. Transactions: Recent transactions: 1 | Categories: Healthcare IT", "Vendor: LogiFast Transport (ID: V008) Industry: Logistics Location: MY Perak Ipoh Certifications: ISO9001 Capabilities: Freight forwarding, warehousing, last-mile delivery Attachments: Transactions: Recent transactions: 1 | Categories: Logistics", "Vendor: Quantum Analytics (ID: V009) Industry: Data Analytics Location: MY WP Kuala Lumpur Kuala Lumpur Certifications: ISO27001 Capabilities: Business intelligence, predictive analytics, AI model development Attachments: Quantum Analytics provides advanced data analytics, machine learning models, and AI-driven business intelligence solutions. Transactions: Recent transactions: 1 | Categories: Data Analytics", "Vendor: InfraSecure Global (ID: V010) Industry: Cybersecurity Location: MY Johor Iskandar Puteri Certifications: ISO27001|SOC2 Capabilities: Critical infrastructure security, OT security, threat intelligence Attachments: InfraSecure Global focuses on operational technology security, protecting critical infrastructure from cyber threats. Transactions: Recent transactions: 2 | Categories: Cybersecurity, Cybersecurity"]